print("Найдем корни квадратного уравнения:")
print("ax2+bx+c=0")
print("Значения а,b,c- произвольные числа, причем а≠0") 
a=int(input("Введите значение a:\n"))
b=int(input("Введите значение b:\n"))
c=int(input("Введите значение с:\n"))
if(a==0 and b==0):
    print("уравнение нерешаемо")    
elif(a==0):
    print("а=0, уравнение является простым")
    print("x=(-c/b)")
    x=(-c/b)
    print("x=", (x))
elif(b==0):
    print("b=0, тогда решение имеет вид:")
    print("x=±√(-(c/a))")
    f=(-(c/a))
    if(f<0):
        print("значение под корнем равно=", (f))
        print("решения нет, т.к. корень не может быть отрицителен")
    if(f>=0):
        print("значение под корнем равно=", (f))
        x1=((f)**1/2)
        x2=-((f)**1/2)
        print("x1=", (x1))
        print("x2=", (x2))
else:
    print("Находим дискрименант")
    print("D = b2 − 4ac")
    D=(b**2-4*a*c) 
    print("дискрименант равен:",(D))
    if(D<0):
        print("D<0")
        print("уравнение корней не имеет")
    if(D==0):
        print("D=0")
        print("уравнение имеет один корень")
        print("x=(-b±√D)/2a")
        print("дискрименант равен:", (D))
        x=((-b+(D)**1/2)/(2*a))
        print(x)
    if(D>0):
        print("D>0")
        print("уравнение имеет два корня")
        print("x=(-b±√D)/2a")
        x1=((-b+(D)**1/2)/(2*a))
        x2=((-b-(D)**1/2)/(2*a))
        print("x1=:", (x1))
        print("x2=", (x2))


